
&НаКлиенте
Процедура Выбрать(Команда)
	
	БуферРезультата = Новый БуферДвоичныхДанных(1);
	БуферРезультата[0] = 0;
	
	Буфер = Новый БуферДвоичныхДанных(3);
	Буфер[0] = ?(ЭтоФункция,1,0); // Локальная
	Буфер[1] = ?(Экспортная,16,0); // Экспорт
	Буфер[2] = ?(Внешняя,32,0); // Внешняя
	
	БуферРезультата.ЗаписатьПобитовоеИли(0, Буфер.ПолучитьСрез(0,1));
	БуферРезультата.ЗаписатьПобитовоеИли(0, Буфер.ПолучитьСрез(1,1));
	БуферРезультата.ЗаписатьПобитовоеИли(0, Буфер.ПолучитьСрез(2,1));
	
	ОповеститьОВыборе(БуферРезультата[0]);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// На 8.3.10 нет глобальных функций
	Буфер = Новый БуферДвоичныхДанных(3);
	Буфер[0] = 1; // ЭтоФункция
	Буфер[1] = 16; // Экспорт
	Буфер[2] = 32; // Внешняя
	
	БуферЗначения = Новый БуферДвоичныхДанных(1);
	БуферЗначения[0] = Параметры.ТекущееЗначение;
	
	Буфер.ЗаписатьПобитовоеИ(0, БуферЗначения);
	Буфер.ЗаписатьПобитовоеИ(1, БуферЗначения);
	Буфер.ЗаписатьПобитовоеИ(2, БуферЗначения);
	
	ЭтоФункция = Буфер[0];
	Экспортная = Буфер[1];
	Внешняя = Буфер[2];
	
КонецПроцедуры
